<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads Adobe Flash Player installer and extracts the embedded package, uploads to JSS.</string>
	<key>Identifier</key>
	<string>com.github.tenny-recipes.jss.AdobeFlashPlayer</string>
	<key>Input</key>
	<dict>
		<key>CATEGORY</key>
		<string>Digital Media</string>
		<key>GROUP_NAME</key>
		<string>AP - %NAME%</string>
		<key>GROUP_TEMPLATE</key>
		<string>AdobeFlashPlayerSmartGroupTemplate.xml</string>
		<key>NAME</key>
		<string>AdobeFlashPlayer</string>
		<key>POLICY_CATEGORY</key>
		<string>Utility</string>
		<key>POLICY_TEMPLATE</key>
		<string>AdobeFlashPlayerPolicyTemplate.xml</string>
		<key>SELF_SERVICE_DESCRIPTION</key>
		<string>Adobe Flash Player is freeware software for using content created on the Adobe Flash platform, including viewing multimedia, executing rich Internet applications, and streaming video and audio.</string>
		<key>SELF_SERVICE_ICON</key>
		<string>AdobeFlashPlayer.png</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.4.0</string>
	<key>ParentRecipe</key>
	<string>com.github.autopkg.pkg.FlashPlayerExtractPackage</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>category</key>
				<string>%CATEGORY%</string>
				<key>extension_attributes</key>
				<array>
					<dict>
						<key>ext_attribute_path</key>
						<string>AdobeFlashPlayerExtensionAttribute.xml</string>
					</dict>
				</array>
				<key>groups</key>
				<array>
					<dict>
						<key>name</key>
						<string>%GROUP_NAME%</string>
						<key>smart</key>
						<true/>
						<key>template_path</key>
						<string>%GROUP_TEMPLATE%</string>
					</dict>
				</array>
				<key>policy_category</key>
				<string>%POLICY_CATEGORY%</string>
				<key>policy_template</key>
				<string>%POLICY_TEMPLATE%</string>
				<key>prod_name</key>
				<string>%NAME%</string>
				<key>self_service_description</key>
				<string>%SELF_SERVICE_DESCRIPTION%</string>
				<key>self_service_icon</key>
				<string>%SELF_SERVICE_ICON%</string>
			</dict>
			<key>Processor</key>
			<string>JSSImporter</string>
		</dict>
	</array>
</dict>
</plist>
